MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/inc/hc32f46x_timer6.h
    /**
     ******************************************************************************
     ** \brief Timer6 base init structure definition
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_basecnt_cfg
    {
        en_timer6_count_mode_t enCntMode; ///< Count mode
        en_timer6_count_dir_t enCntDir;   ///< Count direction
        en_timer6_clk_div_t enCntClkDiv;  ///< Count clock division select
    } stc_timer6_basecnt_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 Trig port config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_port_trig_cfg
    {
        bool bFltEn;                       ///< trig source capture input filter enable
        en_timer6_fconr_fltclk_t enFltClk; ///< Filter clock
    } stc_tiemr6_port_trig_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 port output config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_port_output_cfg
    {
        en_timer6_func_mode_t enPortMode;    ///< Port mode
        bool bOutEn;                         ///< Output enable / disable
        en_timer6_pconr_cmpc_t enPerc;       ///< Port state when counter match the period
        en_timer6_pconr_cmpc_t enCmpc;       ///< Port state when counter match GCMAR(GCMBR)
        en_timer6_pconr_stastps_t enStaStp;  ///< Post state selection when count start/stop
        en_timer6_pconr_port_out_t enStaOut; ///< Port state when count start
        en_timer6_pconr_port_out_t enStpOut; ///< port stop when count stop
        en_timer6_pconr_disval_t enDisVal;   ///< Port output state when brake
    } stc_timer6_port_output_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 port input config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_port_input_cfg
    {
        en_timer6_input_port_t enPortSel;  ///< Port select
        en_timer6_func_mode_t enPortMode;  ///< Port mode
        bool bFltEn;                       ///< trig source capture input filter enable
        en_timer6_fconr_fltclk_t enFltClk; ///< Filter clock
    } stc_timer6_port_input_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 hardware dead time function config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_deadtime_cfg
    {
        bool bEnDeadtime;     ///< Enable hardware dead time function
        bool bEnDtBufUp;      ///< Enable buffer transfer for up count dead time register(DTUBR-->DTUAR)
        bool bEnDtBufDwn;     ///< Enable buffer transfer for down count dead time register(DTDBR-->DTDAR)
        bool bEnDtEqualUpDwn; ///< Enable down count dead time register equal to up count DT register
    } stc_timer6_deadtime_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 valid period config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_validper_cfg
    {
        en_timer6_vperr_pcnts_t enValidCntNum; ///< Valid period selection
        en_timer6_vperr_pcnte_t enValidCdtEn;  ///< Count condition of valid period
        bool bPeriodSCMA;                      ///< Sepcial signal A valid period selection enable
        bool bPeriodSCMB;                      ///< Sepcial signal A valid period selection enable
    } stc_timer6_validper_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 general compare register buffer transfer config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_gcmp_buf_cfg
    {
        bool bEnGcmpTransBuf;                        ///< Enable/Disable buffer transfer
        en_timer6_buf_gcmp_prd_t enGcmpBufTransType; ///< Sigle or double buffer transfer
    } stc_timer6_gcmp_buf_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 period register buffer transfer config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_period_buf_cfg
    {
        bool bEnPeriodTransBuf;                        ///< Enable/Disable buffer transfer
        en_timer6_buf_gcmp_prd_t enPeriodBufTransType; ///< Sigle or double buffer transfer
    } stc_timer6_period_buf_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 Specila compare register buffer transfer config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_spcl_buf_cfg
    {
        bool bEnSpclTransBuf;                        ///< Enable/Disable buffer transfer
        en_timer6_buf_spcl_cmp_t enSpclBufTransType; ///< Sigle or double buffer transfer
        en_timer6_buf_spcl_opt_t enSpclBufOptType;   ///< Buffer transfer opportunity
    } stc_timer6_spcl_buf_cfg_t;

    /**
     ******************************************************************************
     ** \brief Timer6 Z phase input mask config
     ** \note
     ******************************************************************************/
    typedef struct stc_timer6_zmask_cfg
    {
        en_timer6_gconr_zmsk_t enZMaskCycle; ///< Z phase input mask periods selection
        bool bFltPosCntMaksEn;               ///< As position count timer, position counter clear function enable(TRUE) or disable(FALSE) during the time of Z phase input mask
        bool bFltRevCntMaksEn;               ///< As revolution count timer, the counter function enable(TRUE) or disable(FALSE) during the time of Z phase input mask
    } stc_timer6_zmask_cfg_t;

