MarlinFirmware/Marlin/Marlin/lib/h32_core/hdsc/library/inc/hc32f46x_timer6.h
    /*******************************************************************************
     * Global pre-processor symbols/macros ('#define')
     ******************************************************************************/

    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
      Global function prototypes (definition in C source)
     ******************************************************************************/
    /* IRQ config */
    en_result_t Timer6_ConfigIrq(M4_TMR6_TypeDef *TMR6x, en_timer6_irq_type_t enTimer6Irq, bool bEn);
    /* Get status(flag) */
    uint8_t Timer6_GetStatus(M4_TMR6_TypeDef *TMR6x, en_timer6_status_t enStatus);

    /* Base functions */
    en_result_t Timer6_DeInit(M4_TMR6_TypeDef *TMR6x);
    en_result_t Timer6_Init(M4_TMR6_TypeDef *TMR6x, const stc_timer6_basecnt_cfg_t *pstcTimer6BaseCntCfg);
    /* Timer6 unit start count*/
    en_result_t Timer6_StartCount(M4_TMR6_TypeDef *TMR6x);
    /* Timer6 unit stop count*/
    en_result_t Timer6_StopCount(M4_TMR6_TypeDef *TMR6x);
    /* Timer6 unit Set Count Value*/
    en_result_t Timer6_SetCount(M4_TMR6_TypeDef *TMR6x, uint16_t u16Value);
    /* Timer6 unit Get Count Value*/
    uint16_t Timer6_GetCount(M4_TMR6_TypeDef *TMR6x);
    /* Timer6 unit Clear Count Value*/
    en_result_t Timer6_ClearCount(M4_TMR6_TypeDef *TMR6x);

    /* Timer6 unit Set Period and buffer Value*/
    en_result_t Timer6_SetPeriod(M4_TMR6_TypeDef *TMR6x, en_timer6_period_t enTimer6Periodx, uint16_t u16Period);
    /* Timer6 unit set general compare register value*/
    en_result_t Timer6_SetGeneralCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_compare_t enTimer6Compare, uint16_t u16Compare);
    /* Timer6 unit set specoal compare register value*/
    en_result_t Timer6_SetSpecialCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_special_compare_t enTimer6SpclCmp, uint16_t u16SpclCmp);
    /* Timer6 unit get general compare register value*/
    uint16_t Timer6_GetGeneralCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_compare_t enTimer6Compare);

    /* Timer6 unit set period buffer transfer function*/
    en_result_t Timer6_SetPeriodBuf(M4_TMR6_TypeDef *TMR6x, const stc_timer6_period_buf_cfg_t *pstcTimer6PrdBufCfg);
    /* Timer6 unit set general compare buffer transfer function*/
    en_result_t Timer6_SetGeneralBuf(M4_TMR6_TypeDef *TMR6x, en_timer6_chx_port_t enTimer6PWMPort, const stc_timer6_gcmp_buf_cfg_t *pstcTimer6GenBufCfg);
    /* Timer6 unit set special compare buffer transfer function*/
    en_result_t Timer6_SetSpecialBuf(M4_TMR6_TypeDef *TMR6x, en_timer6_special_compare_t enTimer6SpclCmp, const stc_timer6_spcl_buf_cfg_t *pstcTimer6SpclBufCfg);

    /* Timer6 unit Set valid period Value*/
    en_result_t Timer6_SetValidPeriod(M4_TMR6_TypeDef *TMR6x, const stc_timer6_validper_cfg_t *pstcTimer6ValidPerCfg);

    /* Config Input prot and filter function */
    en_result_t Timer6_PortInputConfig(M4_TMR6_TypeDef *TMR6x, const stc_timer6_port_input_cfg_t *pstcTimer6PortInputCfg);
    /* Config output prot function */
    en_result_t Timer6_PortOutputConfig(M4_TMR6_TypeDef *TMR6x, en_timer6_chx_port_t enTimer6PWMPort, const stc_timer6_port_output_cfg_t *pstcTimer6PortOutCfg);

    /* Set dead time register value */
    en_result_t Timer6_SetDeadTimeValue(M4_TMR6_TypeDef *TMR6x, en_timer6_dead_time_reg_t enTimer6DTReg, uint16_t u16DTValue);
    /* Config dead time function */
    en_result_t Timer6_ConfigDeadTime(M4_TMR6_TypeDef *TMR6x, const stc_timer6_deadtime_cfg_t *pstcTimer6DTCfg);

    /* Config Software Synchrony Stop */
    en_result_t Timer6_SwSyncStart(const stc_timer6_sw_sync_t *pstcTimer6SwSyncStart);
    /* Config Software Synchrony Start */
    en_result_t Timer6_SwSyncStop(const stc_timer6_sw_sync_t *pstcTimer6SwSyncStop);
    /* Config Software Synchrony Clear */
    en_result_t Timer6_SwSyncClear(const stc_timer6_sw_sync_t *pstcTimer6SwSyncClear);
    /* Get Software Synchrony Status */
    en_result_t Timer6_GetSwSyncState(stc_timer6_sw_sync_t *pstcTimer6SwSyncState);

    /* Config Hardware up count event */
    en_result_t Timer6_ConfigHwCntUp(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_cnt_t enTimer6HwCntUp);
    /* Clear Hardware up count event */
    en_result_t Timer6_ClearHwCntUp(M4_TMR6_TypeDef *TMR6x);
    /* Config Hardware down count event */
    en_result_t Timer6_ConfigHwCntDwn(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_cnt_t enTimer6HwCntDwn);
    /* Clear Hardware down count event */
    en_result_t Timer6_ClearHwCntDwn(M4_TMR6_TypeDef *TMR6x);

    /* Config Hardware start event */
    en_result_t Timer6_ConfigHwStart(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_trig_t enTimer6HwStart);
    /* Clear Hardware start event */
    en_result_t Timer6_ClearHwStart(M4_TMR6_TypeDef *TMR6x);
    /* Enable Hardware start event */
    en_result_t Timer6_EnableHwStart(M4_TMR6_TypeDef *TMR6x);
    /* Dsiable Hardware start event */
    en_result_t Timer6_DisableHwStart(M4_TMR6_TypeDef *TMR6x);

    /* Config Hardware stop event */
    en_result_t Timer6_ConfigHwStop(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_trig_t enTimer6HwStop);
    /* Clear Hardware stop event */
    en_result_t Timer6_ClearHwStop(M4_TMR6_TypeDef *TMR6x);
    /* Enable Hardware stop event */
    en_result_t Timer6_EnableHwStop(M4_TMR6_TypeDef *TMR6x);
    /* Disable Hardware stop event */
    en_result_t Timer6_DisableHwStop(M4_TMR6_TypeDef *TMR6x);

    /* Config Hardware clear event */
    en_result_t Timer6_ConfigHwClear(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_trig_t enTimer6HwClear);
    /* Clear Hardware clear event */
    en_result_t Timer6_ClearHwClear(M4_TMR6_TypeDef *TMR6x);
    /* Enable Hardware clear event */
    en_result_t Timer6_EnableHwClear(M4_TMR6_TypeDef *TMR6x);
    /* Dsiable Hardware clear event */
    en_result_t Timer6_DisableHwClear(M4_TMR6_TypeDef *TMR6x);

    /* Config Hardware capture event A */
    en_result_t Timer6_ConfigHwCaptureA(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_trig_t enTimer6HwCaptureA);
    /* Clear Hardware capture event A */
    en_result_t Timer6_ClearHwCaptureA(M4_TMR6_TypeDef *TMR6x);
    /* Config Hardware capture event B */
    en_result_t Timer6_ConfigHwCaptureB(M4_TMR6_TypeDef *TMR6x, en_timer6_hw_trig_t enTimer6HwCaptureB);
    /* Clear Hardware capture event B */
    en_result_t Timer6_ClearHwCaptureB(M4_TMR6_TypeDef *TMR6x);
    /* Set trigger source 0 of hardware event */
    en_result_t Timer6_SetTriggerSrc0(en_event_src_t enTriggerSrc);
    /* Set trigger source 1 of hardware event */
    en_result_t Timer6_SetTriggerSrc1(en_event_src_t enTriggerSrc);

    /* Z phase input mask config */
    en_result_t Timer6_ConfigZMask(M4_TMR6_TypeDef *TMR6x, const stc_timer6_zmask_cfg_t *pstcTimer6ZMaskCfg);

    //@} // Timer6Group

#ifdef __cplusplus
}
#endif

#endif /* DDL_TIMER6_ENABLE */

#endif /* __HC32F46x_TIMER6_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
